## Interesting Findings

#### 1) Asian designers are younger and make more money
#### 2) The main challenge for all the designers is 'Design not having a seat at the table'
#### 3) 'Diversity in design and tech' => Fourth biggest challenge to White, First for Black, Second for Asian & Latino
#### 4) Gender pay gap exists except Asian. Asian female get paid better than Asian male.
#### 5) 47.7% of designers are drinking one or two cups of coffee a day
#### 6) 79.1% of designers are satisfied with their work (pretty good or the best). And they tend to make more money.


Note: Data analysis includes only 4 ethnicity groups (White, Latino, Asian, Black).

In [1]:
import pandas as pd

In [2]:
data = pd.read_csv("data/DesignCensus2017_Data.csv")

In [3]:
data.head()

,1 -- I've worked in design for:,2 --I primarily work in:,3 --I'm also good at:,4 --I am currently:,5 --My company specializes in:,6 --My company is:,7 --I teach:,8 --I'm not working because:,9 --My organization has:,10 --My immediate team is:,...,34 --I am:,"35 --Right now, I can't stop listening to:",36 --I live in:,37 --My age is:,38 --I am:,39 --I consider myself:,40 --My ethnicity is:,41 --The most critical issues and challenges currently facing design are (answer optional):,42 --The emerging trends and technologies that will have the biggest impact on design are (answer optional):,43 --The most valuable design skills for the future will be (answer optional):
0,10-14 years,Graphic Design|Marketing|Photography|Web Design,Brainstorming and Ideation|Facilitation|Leader...,A full-time employee at an agency or consultancy,Advertising|Branding|Innovation|Strategy,NaN,NaN,NaN,1-10 employees,2-4 people,...,Not interested in a new job right now,Looking Glass,76051.0,24,Male,Not LGBTQ,White or Caucasian,"Design not having a ""seat at the table""|Genera...",AI and machine learning|Augmented Reality|Beha...,Adaptability to tech and social change|Asking ...
1,1-4 years,Graphic Design|Interaction Design|UI Design|We...,Brainstorming and Ideation|Diversity and Inclu...,A full-time employee at an agency or consultancy,Digital,NaN,NaN,NaN,1-10 employees,Just me,...,Working hard to find my next job,dua lipa,60638.0,25,Female,Not LGBTQ,White or Caucasian,Education cost and equity of access|Generation...,AI and machine learning|Algorithmic design|Beh...,Empathy|Interpersonal skills|Managing complexi...
2,15-20 years,Communication Design|Marketing|Research|Strategy,Mentoring|Project Management|Social Media,A full-time employee in-house,NaN,Non-Profit,NaN,NaN,11-50 employees,2-4 people,...,Working hard to find my next job,Sia,10005.0,43,Male,Not LGBTQ,White or Caucasian,None of these,None of these,None of these
3,10-14 years,Communication Design|Graphic Design|Illustrati...,Brainstorming and Ideation|Drawing or Painting...,A full-time employee in-house,NaN,For-Profit/Corporate,NaN,NaN,1000+ employees,11-20 people,...,"Open to opportunities, but not actively looking","My cats, begging for breakfast",11217.0,34,Male,Not LGBTQ,White or Caucasian,Advertising supported content model|Algorithm ...,AI and machine learning|Algorithmic design|Con...,Adaptability to tech and social change|Communi...
4,15-20 years,Communication Design|Environmental Design|Grap...,Brainstorming and Ideation|Business|Drawing or...,A full-time employee at an agency or consultancy,Advertising|Branding|Digital|Innovation|Print|...,NaN,NaN,NaN,11-50 employees,5-10 people,...,Not interested in a new job right now,Big Little Lies Soundtrack,94114.0,39,Male,LGBTQ,White or Caucasian,Advertising supported content model|Algorithm ...,3D printing|AI and machine learning|Algorithmi...,Adaptability to tech and social change|Psychol...

In [66]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13158 entries, 0 to 13157
Data columns (total 43 columns):
1 -- I've worked in design for:                                                                                 13158 non-null object
2 --I primarily work in:                                                                                        13158 non-null object
3 --I'm also good at:                                                                                           13158 non-null object
4 --I am currently:                                                                                             13158 non-null object
5 --My company specializes in:                                                                                  5960 non-null object
6 --My company is:                                                                                              5841 non-null object
7 --I teach:                                                                                                    358 non-null object
8 --I'm not working because:                                                                                    327 non-null object
9 --My organization has:                                                                                        12749 non-null object
10 --My immediate team is:                                                                                      12756 non-null object
11 --My work touches these industries or sectors:                                                               12757 non-null object
12 --I�۪ve been at my current place of work for:                                                                12757 non-null object
13 --My role is:                                                                                                6068 non-null object
14 --My role is:                                                                                                5941 non-null object
15 --My role is:                                                                                                389 non-null object
16 --I've been in my current role for:                                                                          12757 non-null object
17 --I typically work:                                                                                          12757 non-null object
18 --My annual salary is:                                                                                       12761 non-null float64
19 --My job provides:                                                                                           12758 non-null object
20 --In my current role, there is:                                                                              12759 non-null object
21 --In my current role, I am:                                                                                  12759 non-null object
22 --My job is:                                                                                                 12759 non-null object
23 --My job stability is:                                                                                       12759 non-null object
24 --In addition to my job, I also:                                                                             12759 non-null object
25 --I fuel my daily creativity with coffee:                                                                    13158 non-null object
26 --Highest level of education I've completed:                                                                 13158 non-null object
27 --I learned design:                                                                                          13158 non-null object
28 --My major focus of study was:                                                                               13158 non-null object
29 --Over my career, I've had:                                                                                  13158 non-null object
30 --I've shifted my specialty or focus area:                                                                   13158 non-null object
31 --I stay current with design by:                                                                             13158 non-null object
32 --I'm a member of:                                                                                           13158 non-null object
33 --I'd like to get better at:                                                                                 13158 non-null object
34 --I am:                                                                                                      13158 non-null object
35 --Right now, I can't stop listening to:                                                                      13058 non-null object
36 --I live in:                                                                                                 10776 non-null float64
37 --My age is:                                                                                                 13158 non-null int64
38 --I am:                                                                                                      13158 non-null object
39 --I consider myself:                                                                                         13158 non-null object
40 --My ethnicity is:                                                                                           13158 non-null object
41 --The most critical issues and challenges currently facing design are (answer optional):                     12719 non-null object
42 --The emerging trends and technologies that will have the biggest impact on design are (answer optional):    12503 non-null object
43 --The most valuable design skills for the future will be (answer optional):                                  12729 non-null object
dtypes: float64(2), int64(1), object(40)
memory usage: 4.3+ MB

In [5]:
data["40 --My ethnicity is:"].value_counts().reset_index().head()

                                 index  40 --My ethnicity is:
0                   White or Caucasian                   8954
1                                Asian                   1377
2  Latina, Latino, Latinx, or Hispanic                    899
3            Black or African American                    409
4                    Prefer not to say                    352

# Ethnicity

In [6]:
ethnicity = data["40 --My ethnicity is:"].value_counts()

In [7]:
total = ethnicity.sum()

In [8]:
total

13158

## 1) White

In [9]:
race_white = data[data['40 --My ethnicity is:'] == 'White or Caucasian']

In [10]:
float(len(race_white))*100/total  #pct of white

68.04985560115519

In [11]:
race_white['37 --My age is:'].mean() #avg age

33.188184051820414

In [12]:
race_white['18 --My annual salary is:'].mean() #avg income

69157.28885077187

In [13]:
race_white['38 --I am:'].value_counts().reset_index() #gender

                        index  38 --I am:
0                      Female        4872
1                        Male        4000
2  Non-binary or third gender          58
3           Prefer not to say          24

In [14]:
white_challenges = race_white['41 --The most critical issues and challenges currently facing design are (answer optional):']

In [15]:
white_challenges.value_counts().sort_values(ascending=False).reset_index().head()

,index,41 --The most critical issues and challenges currently facing design are (answer optional):
0,None of these,483
1,"Design not having a ""seat at the table""",459
2,"Design not having a ""seat at the table""|Genera...",173
3,Generational differences in the workforce,152
4,"Design not having a ""seat at the table""|Divers...",114

In [16]:
race_white.groupby("1 -- I've worked in design for:")['18 --My annual salary is:'].mean().sort_values(ascending=False).reset_index()

  1 -- I've worked in design for:  18 --My annual salary is:
0                       20+ years               96040.563918
1                     15-20 years               93695.455135
2                     10-14 years               79044.524718
3                       5-9 years               67778.381942
4                       1-4 years               50772.952253
5                Less than 1 year               34488.485030

In [17]:
race_white.groupby("38 --I am:")['18 --My annual salary is:'].mean().sort_values(ascending=False).reset_index()

                   38 --I am:  18 --My annual salary is:
0                        Male               78762.928041
1                      Female               61554.009458
2  Non-binary or third gender               57177.241379
3           Prefer not to say               42541.666667

In [18]:
#race_white['22 --My job is:'].value_counts().sort_values(ascending=False).reset_index().head()

## 2) Asian

In [19]:
race_asian = data[data['40 --My ethnicity is:'] == 'Asian']

In [20]:
float(len(race_asian))*100/total  #pct of asian

10.465116279069768

In [21]:
race_asian['37 --My age is:'].mean() #avg age

29.112563543936094

In [22]:
race_asian['18 --My annual salary is:'].mean() #avg income

72199.86712749615

In [23]:
race_asian['38 --I am:'].value_counts().reset_index() #gender

                        index  38 --I am:
0                      Female         772
1                        Male         590
2  Non-binary or third gender          10
3           Prefer not to say           5

In [24]:
asian_challenges = race_asian['41 --The most critical issues and challenges currently facing design are (answer optional):']

In [25]:
asian_challenges.value_counts().sort_values(ascending=False).reset_index().head()

,index,41 --The most critical issues and challenges currently facing design are (answer optional):
0,None of these,49
1,"Design not having a ""seat at the table""",38
2,Diversity in design and tech,24
3,"Design not having a ""seat at the table""|Divers...",21
4,"Design not having a ""seat at the table""|Genera...",15

In [26]:
race_asian.groupby("1 -- I've worked in design for:")['18 --My annual salary is:'].mean().sort_values(ascending=False).reset_index()

  1 -- I've worked in design for:  18 --My annual salary is:
0                     10-14 years              101375.684564
1                       20+ years               93111.111111
2                     15-20 years               92922.517647
3                       5-9 years               78412.234463
4                       1-4 years               62384.512324
5                Less than 1 year               40513.654545

In [27]:
race_asian.groupby("38 --I am:")['18 --My annual salary is:'].mean().sort_values(ascending=False).reset_index()

                   38 --I am:  18 --My annual salary is:
0           Prefer not to say              179780.000000
1                      Female               74270.756831
2                        Male               69150.870270
3  Non-binary or third gender               36040.000000

In [28]:
#race_asian['22 --My job is:'].value_counts().sort_values(ascending=False).reset_index().head()

## 3) Latina, Latino, Latinx, or Hispanic

In [29]:
race_latino = data[data['40 --My ethnicity is:'] == 'Latina, Latino, Latinx, or Hispanic']

In [30]:
float(len(race_latino))*100/total  #pct of ratino

6.83234534123727

In [31]:
race_latino['37 --My age is:'].mean() #avg age

31.53281423804227

In [32]:
race_latino['18 --My annual salary is:'].mean() #avg income

54967.211627906974

In [33]:
race_latino['38 --I am:'].value_counts().reset_index() #gender

                        index  38 --I am:
0                      Female         446
1                        Male         443
2  Non-binary or third gender           6
3           Prefer not to say           4

In [34]:
latino_challenges = race_latino['41 --The most critical issues and challenges currently facing design are (answer optional):']

In [35]:
latino_challenges.value_counts().sort_values(ascending=False).reset_index().head()

,index,41 --The most critical issues and challenges currently facing design are (answer optional):
0,None of these,45
1,"Design not having a ""seat at the table""",38
2,Diversity in design and tech,19
3,"Design not having a ""seat at the table""|Divers...",13
4,Generational differences in the workforce,13

In [36]:
race_latino.groupby("1 -- I've worked in design for:")['18 --My annual salary is:'].mean().sort_values(ascending=False).reset_index()

  1 -- I've worked in design for:  18 --My annual salary is:
0                     15-20 years               77801.469880
1                     10-14 years               73388.370861
2                       20+ years               65540.690476
3                       5-9 years               53322.000000
4                       1-4 years               41833.962585
5                Less than 1 year               36308.130435

In [37]:
race_latino.groupby("38 --I am:")['18 --My annual salary is:'].mean().sort_values(ascending=False).reset_index()

                   38 --I am:  18 --My annual salary is:
0  Non-binary or third gender               67833.333333
1                        Male               57318.797203
2                      Female               52492.981043
3           Prefer not to say               41000.000000

In [38]:
#race_latino['22 --My job is:'].value_counts().sort_values(ascending=False).reset_index().head()

## 4) Black or African American

In [39]:
race_black = data[data['40 --My ethnicity is:'] == 'Black or African American']

In [40]:
float(len(race_black))*100/total #pct of black

3.108375132998936

In [41]:
race_black['37 --My age is:'].mean() #avg age

32.10268948655257

In [42]:
race_black['18 --My annual salary is:'].mean() #avg income

62897.52971576228

In [43]:
race_black['38 --I am:'].value_counts().reset_index()

                        index  38 --I am:
0                      Female         206
1                        Male         193
2  Non-binary or third gender           7
3           Prefer not to say           2
4                       Other           1

In [44]:
black_challenges = race_black['41 --The most critical issues and challenges currently facing design are (answer optional):']

In [45]:
black_challenges.value_counts().sort_values(ascending=False).reset_index().head()

,index,41 --The most critical issues and challenges currently facing design are (answer optional):
0,"Design not having a ""seat at the table""|Divers...",21
1,"Design not having a ""seat at the table""|Divers...",20
2,Diversity in design and tech,19
3,None of these,18
4,"Design not having a ""seat at the table""",11

In [46]:
race_black.groupby("1 -- I've worked in design for:")['18 --My annual salary is:'].mean().sort_values(ascending=False).reset_index()

  1 -- I've worked in design for:  18 --My annual salary is:
0                       20+ years              170557.653846
1                     15-20 years               80391.025641
2                     10-14 years               65450.130435
3                       5-9 years               59944.478723
4                       1-4 years               42216.584507
5                Less than 1 year               36823.529412

In [47]:
race_black.groupby("38 --I am:")['18 --My annual salary is:'].mean().sort_values(ascending=False).reset_index()

                   38 --I am:  18 --My annual salary is:
0                       Other              150000.000000
1                        Male               73569.172043
2           Prefer not to say               60000.000000
3                      Female               52630.041237
4  Non-binary or third gender               47450.000000

In [48]:
#race_black['22 --My job is:'].value_counts().sort_values(ascending=False).reset_index().head()

# Pay gap

In [49]:
# avg annual income
data['18 --My annual salary is:'].mean()

68133.10908236032

### 1) By gender

In [50]:
data.groupby('38 --I am:')['18 --My annual salary is:'].mean().sort_values(ascending=False).reset_index()

                   38 --I am:  18 --My annual salary is:
0                        Male               75577.601048
1           Prefer not to say               70878.084112
2                      Female               62081.313645
3  Non-binary or third gender               53145.154639
4                       Other               49444.555556

### 2) By years at work

In [51]:
data.groupby("1 -- I've worked in design for:")['18 --My annual salary is:'].mean().sort_values(ascending=False).reset_index()

  1 -- I've worked in design for:  18 --My annual salary is:
0                       20+ years               96403.539787
1                     15-20 years               92342.047096
2                     10-14 years               80112.650864
3                       5-9 years               67535.087531
4                       1-4 years               51167.401941
5                Less than 1 year               35664.206081

### 3) Contract vs. Full-time

In [52]:
data.groupby('4 --I am currently:')['18 --My annual salary is:'].mean().sort_values(ascending=False).reset_index()

                                4 --I am currently:  18 --My annual salary is:
0                     A full-time employee in-house               76624.958115
1  A full-time employee at an agency or consultancy               68563.711661
2                                       An educator               61831.308483
3                      A contract employee in-house               61262.208955
4                      Self-employed or freelancing               53743.222832
5   A contract employee at an agency or consultancy               52392.527869
6                                             Other               41283.648352
7                                       Not working                        NaN

### 4) Company size

In [53]:
data.groupby('9 --My organization has:')['18 --My annual salary is:'].mean().sort_values(ascending=False).reset_index()

  9 --My organization has:  18 --My annual salary is:
0          1000+ employees               91846.667354
1       501-1000 employees               76096.994543
2        251-500 employees               68101.799082
3        101-250 employees               67028.322019
4         51-100 employees               65563.709649
5          11-50 employees               60695.692117
6           1-10 employees               54695.479444
7                 Not sure               37950.975610

### 5) Team size

In [54]:
data.groupby('10 --My immediate team is:')['18 --My annual salary is:'].mean().sort_values(ascending=False).reset_index()

  10 --My immediate team is:  18 --My annual salary is:
0                 20+ people              113202.028409
1               11-20 people               84201.368859
2                5-10 people               73472.123522
3                 2-4 people               63011.809921
4                    Just me               51613.452215

### 6) Education

In [55]:
data.groupby("26 --Highest level of education I've completed:")['18 --My annual salary is:'].mean().sort_values(ascending=False).reset_index()

  26 --Highest level of education I've completed:  18 --My annual salary is:
0                                       Doctorate               86929.681319
1                                 Master's degree               80833.364391
2                               Bachelor's degree               66922.952272
3                                    Some college               62810.105023
4                             High School or less               56120.990826
5                              Associate's degree               54193.252708
6                 Technical degree or certificate               51867.329932

### 7) LGBT

In [56]:
data.groupby("39 --I consider myself:")['18 --My annual salary is:'].mean().sort_values(ascending=False).reset_index()

  39 --I consider myself:  18 --My annual salary is:
0               Not LGBTQ               69652.317915
1                   LGBTQ               62107.280387
2       Prefer not to say               61868.132475

# Coffee

In [57]:
data['25 --I fuel my daily creativity with coffee:'].value_counts().reset_index()

         index  25 --I fuel my daily creativity with coffee:
0     1-2 cups                                          6279
1     3-4 cups                                          2449
2  No way, tea                                          2252
3        Other                                          1542
4     5-6 cups                                           483
5     7-8 cups                                           103
6     10+ cups                                            30
7    9-10 cups                                            20

In [58]:
float(6279)/total

0.4772001823985408

# Job satisfaction

In [59]:
data['22 --My job is:'].value_counts().reset_index()

         index  22 --My job is:
0  Pretty good             8175
1     The best             2239
2    Not great             1971
3     Not sure              211
4    The worst              163

In [60]:
float(8175 + 2239)/total

0.7914576683386533

In [61]:
data.groupby('22 --My job is:')['18 --My annual salary is:'].mean().sort_values(ascending=False).reset_index()

  22 --My job is:  18 --My annual salary is:
0        The best               74610.825290
1     Pretty good               69432.999633
2       Not great               58994.336885
3       The worst               55054.687117
4        Not sure               44846.701422

In [62]:
#data.groupby('22 --My job is:')['38 --I am:'].value_counts()

In [63]:
#data.groupby('22 --My job is:')['17 --I typically work:'].value_counts()

# Working hour

In [64]:
data['17 --I typically work:'].value_counts()

40 hours per week              5626
41-50 hours per week           4150
Less than 40 hours per week    1991
51-60 hours per week            727
60+ hours per week              263
Name: 17 --I typically work:, dtype: int64

In [65]:
data.groupby('17 --I typically work:')['18 --My annual salary is:'].mean().sort_values(ascending=False).reset_index()

        17 --I typically work:  18 --My annual salary is:
0         51-60 hours per week               85607.940853
1           60+ hours per week               80931.783270
2         41-50 hours per week               75580.351325
3            40 hours per week               67086.755378
4  Less than 40 hours per week               47555.859367